src/test/artillery/test.yml
config:
  # URL base del servidor que vamos a someter a la prueba
  target: "http://localhost:5000"
  phases:
    # Durante 60 segundos Artillery enviara trafico constante
    - duration: 10
      # arrivalRate indica cuantos usuarios virtuales por segundo se crean
      arrivalRate: 10

scenarios:
  - flow:
      # Cada usuario virtual realiza una peticion GET a la ruta /test
      - get:
          url: "/test"